import Container from "../../UI/Container/Container";
import style from "./Frame.module.scss";

const Frame = () => {
  return (
    <div className={style.frame}>
      <Container>
        <section className={style.section}>
          <h2>
            Перше заняття завжди важливо, оскільки воно допомагає зрозуміти, чи
            підходить вам даний вид занять і наскільки вони вам цікаві. iSpeak
            хоче запропонувати вам наше перше заняття БЕЗКОШТОВНО, незалежно від
            віку.
          </h2>
          <p className={style.titleList}>На першому занятті ви зможете:</p>
          <ul>
            <li>
              Познайомитись з викладачем і дізнатись більше про нашу методику
              навчання
            </li>
            <li>Зрозуміти, наскільки даний вид занять цікавий для вас</li>
            <li>Визначити рівень своїх знань</li>
            <li>Отримати перші знання та навички</li>
          </ul>
          <p style={{ marginBottom: 10 }}>
            Ми гарантуємо, що ви проведете час з користю та інтересом, і будете
            готові продовжувати навчання у нас. Ми цінуємо кожного нашого учня і
            готові допомогти вам досягти своїх цілей та успіхів.
          </p>
          <p>
            Сподіваємось, наша пропозиція вас зацікавить!
            <br />
            Якщо у вас є якісь питання або побажання, не соромтеся задавати їх
            мені. Я буду рада допомогти вам!
          </p>
        </section>
      </Container>
    </div>
  );
};

export default Frame;
