import Container from "../../UI/Container/Container";
import style from "./About.module.scss";

const About = () => {
  return (
    <div className={style.about} id="about">
      <Container>
        <section className={style.section}>
          <h2>Про нас</h2>

          <div className={style.content}>
            <div style={{ marginBottom: "100px" }} className={style.item}>
              <img src="./img/about/about.png" alt="" />
              <div className={style.info}>
                <h2>Забудь про нудні матеріали</h2>
                <p>
                  iSpeak - інтерактивна школа, яка допоможе тобі освоїти
                  будь-який рівень знань з англійської мови незалежно від віку!
                  <br />
                  Забудь про нудні матеріали та заучування, разом ми будемо
                  вчитися у ігровій та інтерактивній формі.
                  <br />
                  Ми обіцяємо, що наші уроки будуть повні пригод та незвичайних
                  завдань, які допоможуть тобі покращити свої знання та
                  навчитися новому.
                  <br />
                  Давай почнемо захоплюючу подорож у світ англійської мови
                  разом!
                </p>
              </div>
            </div>

            <div
              style={{ flexDirection: "row-reverse", alignItems: "start" }}
              className={style.item}
            >
              <img src="./img/about/about2.png" alt="" />
              <div className={style.info}>
                <h2>На одній хвилі з нашими учнями</h2>
                <p>
                  У нашій команді – молоді та талановиті фахівці, які знають, як
                  працювати з кожним хто прагне вивчити щось нове, будь-якого
                  віку!
                  <br />
                  Відкрий двері у своє майбутнє прямо зараз, разом з нами. Ми
                  знаходимося на одній хвилі з нашими юними учнями та вміємо
                  підходити до кожного з них індивідуально.
                  <br /> Наша робота – це не лише передача знань, а й створення
                  захоплюючої атмосфери, в якій наші учні з радістю
                  навчатимуться.
                  <br /> Ми використовуємо найсучасніші методи навчання та
                  постійно розвиваємося, щоб бути на крок попереду та допомогти
                  нашим учням досягти великих успіхів.
                  <br /> Давайте разом поринемо в захоплюючий світ знань та
                  відкриттів!
                </p>
              </div>
            </div>
          </div>
        </section>
      </Container>
    </div>
  );
};

export default About;
